{
  "main": {
    "name": "Franco Mischuk",
    "occupation": "Platform Engineer / Backend Developer",
    "description": "With a passion for perfection, my goal is to contribute my skills and expertise to a supportive and stable company. I am driven to continuously develop and improve my abilities, aiming to become an exceptional software developer.",
    "profilePicture": "/images/profilepic.jpg",
    "bio": "As a driven professional, I possess an unwavering determination to excel and continuously grow in my work. I thrive on challenges and consistently strive for excellence in every endeavor. My relentless pursuit of improvement fuels my motivation to deliver exceptional results and surpass expectations. With a strong work ethic and a commitment to excellence, I consistently strive to go above and beyond to achieve optimal outcomes.",
    "email": "mischuk.ti@gmail.com",
    "phone": "+54 9 223 518-1256",
    "address": {
      "city": "Mar Del Plata",
      "state": "Buenos Aires"
    },
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/franco-mischuk-125a46149/",
        "faPrefix": "fab",
        "faIcon": "linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Frachuk",
        "faPrefix": "fab",
        "faIcon": "github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "National Technological University",
        "degree": "Superior Technician in Programming",
        "graduated": "2018",
        "description": "After completing my technician school, I eagerly pursued a bachelor's degree. Concurrently, I embarked on a professional journey as a technician at the local Casino, where I had the opportunity to apply my programming and software skills. During my time at the university, I not only expanded my foundational knowledge but also honed my abilities through practical tasks related to programming and software development at the casino. This valuable experience allowed me to further solidify my expertise and bridge the gap between theory and real-world application."
      },
      {
        "school": "High Technician School N ° 5",
        "degree": "Computer Technician",
        "graduated": "2015",
        "description": "I took my first steps in the programming world, laying the foundation of my technical knowledge. Through engaging coursework and practical projects, I gained proficiency in programming languages, algorithms, and software development principles. This immersive experience ignited my curiosity and honed my problem-solving skills, fueling my passion for pursuing a career in technology."
      }
    ],
    "work": [
      {
        "company": "Thanx",
        "title": "Technical Operations Engineer",
        "years": "May. 2024 - Present",
        "description": "Own mobile app operations for 270+ merchant apps on the Apple Pie Squad. Optimized Android CI builds by 56% and local builds by 84%. Built CLI automation tools for release cuts, APNs certificate renewal, and merchant onboarding. Led SOP-to-AI-command conversion initiative, driving team-wide adoption of Claude Code for operational automation."
      },
      {
        "company": "GlobalLogic",
        "title": "Backend Software Engineer",
        "years": "Dec. 2022 - Jun. 2024",
        "description": "Collaborate with editorial, manifest, and front-end teams to build and maintain backend services that power AMC Networks' web platform. Focused on data enrichment pipelines and API integrations that drive content delivery across streaming properties."
      },
      {
        "company": "GlobalLogic",
        "title": "Platform & Backend Software Engineer",
        "years": "Aug. 2020 - Dec. 2022.",
        "description": "Led development of internal scaffolding templates used across engineering teams. Conducted technical interviews for new hires and owned the onboarding process, helping scale the platform team during a period of rapid growth."
      },
      {
        "company": "Avalith",
        "title": "Fullstack Developer",
        "years": "Mar. 2019 - Aug. 2020",
        "description": "Delivered full-stack features across multiple client projects (Rappi, Origenes Seguros). Beyond development, conducted technical interviews and mentored new hires to help grow the engineering team."
      },
      {
        "company": "Boldt S.A",
        "title": "Technician",
        "years": "Apr. 2015 - Jun. 2018",
        "description": "Handled end-to-end setup of slot machines — from hardware installation to software configuration. Performed integration testing, diagnostics, and troubleshooting to ensure reliable operation across the casino floor."
      }
    ],
    "projects": [
      {
        "partner": "Thanx",
        "rol": "Technical Operations Engineer",
        "name": "APS AI Brain & Claude Plugins",
        "years": "Feb. 2026 - Present",
        "description": "Designed a multi-agent cognitive system (AI Brain) for team operations with structured memory, workflow automation, and scoped agents. Led conversion of 24+ SOPs into reusable Claude commands via thanx-claude-plugins, enabling company-wide AI-assisted operational automation.",
        "techStack": [
          "Claude Code",
          "MCP (Keystone)",
          "Node.js",
          "Jira",
          "Notion",
          "GitHub"
        ]
      },
      {
        "partner": "Thanx",
        "rol": "Technical Operations Engineer",
        "name": "APNs Certificate Automation",
        "years": "Jan. 2026 - Feb. 2026",
        "description": "Automated Apple Push Notification certificate renewal via a cron job that detects expiring certificates and renews them automatically. Includes Slack webhook alerts and monitoring, eliminating a manual process that previously risked push notification outages for merchant apps.",
        "techStack": [
          "Node.js",
          "Apple Developer API",
          "CircleCI",
          "Slack Webhooks",
          "Cron"
        ]
      },
      {
        "partner": "Thanx",
        "rol": "Technical Operations Engineer",
        "name": "Android Build Optimization",
        "years": "Sept. 2024 - Mar. 2025",
        "description": "Optimized Gradle JVM configuration for Android build flavors across 270+ merchant apps. Achieved 55.9% faster CI builds on CircleCI and 83.6% faster local builds (from 5m29s to 54s), reducing engineering time and CI costs company-wide.",
        "techStack": [
          "React Native",
          "Gradle",
          "CircleCI",
          "JVM",
          "Android"
        ]
      },
      {
        "partner": "Thanx",
        "rol": "Technical Operations Engineer",
        "name": "thanx-appops CLI Tools",
        "years": "Aug. 2024 - Feb. 2026",
        "description": "Built a suite of 6 Node.js CLI tools automating core operational workflows: release cuts, SendGrid custom domain setup, Firebase app creation, Apple agreement emails, and Android app signing. Used across the entire engineering org to standardize and accelerate merchant operations.",
        "techStack": [
          "Node.js",
          "SendGrid API",
          "Firebase",
          "Apple Developer API",
          "CircleCI",
          "Fastlane"
        ]
      },
      {
        "partner": "Thanx",
        "rol": "Technical Operations Engineer",
        "name": "Fastlane & Release Pipeline Improvements",
        "years": "Jan. 2025 - Jun. 2025",
        "description": "Built a cache layer for Fastlane's fetch_app_configuration to eliminate redundant API calls during builds. Fixed critical pipeline blockers affecting all iOS releases, discovered workarounds for Apple-side issues, and modernized the release cut SOP with a data-driven validation approach.",
        "techStack": [
          "Ruby",
          "Fastlane",
          "CircleCI",
          "Apple App Store Connect API",
          "iOS",
          "Android"
        ]
      },
      {
        "partner": "AMC Networks",
        "rol": "Backend Developer",
        "name": "Ingest Script",
        "years": "Dec. 2022 - Jun. 2024",
        "description": "Built an automated pipeline that fetches streaming schedule data from Nielsen via FTP, enriches it through a CMS, and stores assets in Cloudinary. Runs on AWS Batch for scalable execution with CloudWatch monitoring and Splunk logging, replacing a manual workflow and ensuring up-to-date scheduling data across AMC's platforms.",
        "techStack": [
          "Node",
          "AWS Batch",
          "CloudWatch",
          "FTP",
          "Cloudinary",
          "Splunk"
        ]
      },
      {
        "partner": "AMC Networks",
        "rol": "Backend Developer",
        "name": "Universal Search",
        "years": "Dec. 2022 - Jun. 2024",
        "description": "Developed an ETL service that parses content via third-party integrations, processes it through Kafka event streams, and stores results in S3. Enhanced AMC's cross-platform search capabilities by unifying content from multiple sources into a single searchable index.",
        "techStack": [
          "Node",
          "Express",
          "Xls",
          "Kafka",
          "AWS",
          "CloudWatch",
          "Stoplight",
          "Splunk"
        ]
      },
      {
        "partner": "Myself",
        "rol": "Frontend Developer",
        "name": "This resume",
        "years": "N/A - Present",
        "description": "Personal project — a responsive resume page built with React and Bootstrap, deployed to GitHub Pages. Features a component-based architecture with Jest test coverage.",
        "techStack": [
          "React",
          "jest",
          "gh-pages",
          "bootstrap"
        ]
      },
      {
        "partner": "Savvi",
        "rol": "Frontend Developer",
        "name": "Savvi - UI",
        "webPage": "https://www.savvi.com/www",
        "years": "Sept. 2022 - Mar. 2023",
        "description": "Refactored an existing e-commerce platform to reduce code complexity and improve page performance, resulting in a cleaner codebase and faster load times.",
        "techStack": [
          "Angular",
          "FontAwesome",
          "Bootstrap"
        ]
      },
      {
        "partner": "GameStop",
        "rol": "Platform Engineer",
        "name": "Launchpad templates generator",
        "years": "Aug. 2020 - Dec. 2022",
        "description": "Built a Yeoman-based CLI tool that scaffolds production-ready REST APIs with pre-configured CI/CD pipelines, automated testing, and deployment workflows. Supported multiple languages (Node, Go, Java, .NET) across a Nx monorepo, accelerating new service creation for GameStop's engineering teams.",
        "techStack": [
          "Node",
          "React",
          "Monorepo with nx",
          "Go",
          "Java",
          ".NET",
          "C#",
          "TypeScript",
          "Docker",
          "Cloudformation",
          "Terraform",
          "New relic",
          "JFrog",
          "Prisma",
          "AWS",
          "Spring",
          "Express",
          "Jest",
          "Junit",
          "Lombok"
        ]
      },
      {
        "partner": "GameStop",
        "rol": "Backend Developer",
        "name": "Hyperion PBCS",
        "years": "Sept. 2020 - Jan. 2022",
        "description": "Built a data transformation service that parses S3 files and converts them into a structured CSV format compatible with GameStop's business intelligence tools, using Node streams and custom transforms for efficient large-file processing.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "Git (GitLab)",
          "Jira",
          "AWS-SDK",
          "Streams",
          "Node Custom transforms"
        ]
      },
      {
        "partner": "GameStop",
        "rol": "Backend Developer",
        "name": "Narvar Shipment Processor",
        "years": "Sept. 2020 - Jan. 2022",
        "description": "Developed an event-driven service triggered by S3 write events that automatically generates shipment orders from uploaded file data, processing messages via SQS for reliable order fulfillment.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "Git (GitLab)",
          "Jira",
          "AWS-SDK",
          "SQS-Consumer"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Rappi Games",
        "years": "Jun. 2020 - Aug. 2020",
        "description": "Developed the backend service powering tournament token management for Rappi Games — handling token issuance, redemption, and balance tracking to support in-app gaming tournaments across Rappi's user base.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Live",
        "years": "May. 2020 - Jun. 2020",
        "description": "Built the backend for Rappi's live streaming commerce feature, enabling users to purchase and watch live streams directly within the app — combining content delivery with integrated payment processing.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Gifts",
        "years": "Feb. 2020 - May. 2020",
        "description": "Developed the gift-sending feature for Rappi's store, allowing users to select products and send them as gifts to contacts with personalized delivery — integrated into the existing checkout and logistics flows.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Ticket Events",
        "years": "Sept. 2019 - Feb. 2020",
        "description": "Built the backend service for selling concert tickets through Rappi, integrating with multiple Latin American ticketing providers via SOAP APIs. Handled event catalog sync, seat selection, and payment orchestration across different vendor systems.",
        "techStack": [
          "Node",
          "TypeScript",
          "Express",
          "Jest",
          "MongoDB",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira",
          "SOAP"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Aliados",
        "years": "Aug. 2019 - Sept. 2019",
        "description": "Developed a multi-threaded web scraping service in Java that collected pricing and catalog data from competitor platforms, feeding it into Rappi's analytics pipeline for market intelligence and competitive analysis.",
        "techStack": [
          "Java 11",
          "Lombok",
          "Spring Boot",
          "Open Csv",
          "Jsoup",
          "Git (Bitbucket)",
          "MongoDB",
          "Threads"
        ]
      },
      {
        "partner": "Origenes Seguros",
        "rol": "Frontend Developer",
        "name": "Onboarding Page",
        "years": "Jul. 2019 - Aug. 2019",
        "description": "Built a pixel-perfect onboarding landing page for new insurance customers using React Hooks and SASS, focused on conversion-oriented UX and responsive design.",
        "techStack": [
          "React using Hooks",
          "SASS",
          "Gulp",
          "Git (with GitLab)",
          "Pixel perfect designs."
        ]
      }
    ]
  }
}