{
  "main": {
    "name": "Franco Mischuk",
    "occupation": "Senior Platform Engineer/Backend Developer",
    "description": "With a passion for perfection, my goal is to contribute my skills and expertise to a supportive and stable company. I am driven to continuously develop and improve my abilities, aiming to become an exceptional software developer.",
    "profilePicture": "/images/profilepic.jpg",
    "bio": "As a driven professional, I possess an unwavering determination to excel and continuously grow in my work. I thrive on challenges and consistently strive for excellence in every endeavor. My relentless pursuit of improvement fuels my motivation to deliver exceptional results and surpass expectations. With a strong work ethic and a commitment to excellence, I consistently strive to go above and beyond to achieve optimal outcomes.",
    "email": "mischuk.ti@gmail.com",
    "phone": "+54 9 223 518-1256",
    "address": {
      "city": "Mar Del Plata",
      "state": "Buenos Aires"
    },
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/franco-mischuk-125a46149/",
        "faPrefix": "fab",
        "faIcon": "linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Frachuk",
        "faPrefix": "fab",
        "faIcon": "github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "National Technological University",
        "degree": "Superior Technician in Programming",
        "graduated": "2018",
        "description": "After completing my technician school, I eagerly pursued a bachelor's degree. Concurrently, I embarked on a professional journey as a technician at the local Casino, where I had the opportunity to apply my programming and software skills. During my time at the university, I not only expanded my foundational knowledge but also honed my abilities through practical tasks related to programming and software development at the casino. This valuable experience allowed me to further solidify my expertise and bridge the gap between theory and real-world application."
      },
      {
        "school": "High Technician School N ° 5",
        "degree": "Computer Technician",
        "graduated": "2015",
        "description": "I took my first steps in the programming world, laying the foundation of my technical knowledge. Through engaging coursework and practical projects, I gained proficiency in programming languages, algorithms, and software development principles. This immersive experience ignited my curiosity and honed my problem-solving skills, fueling my passion for pursuing a career in technology."
      }
    ],
    "work": [
      {
        "company": "GlobalLogic",
        "title": "Backend Software Engineer",
        "years": "Dec. 2022 - Present.",
        "description": "At present, I am working as a Backend Software Engineer, actively collaborating with the editorial, manifest, and front-end teams. In this capacity, I play a vital role in enhancing the data displayed on the web platform. By leveraging my skills and expertise, I contribute to enriching the content and delivering a seamless user experience. Through close collaboration with cross-functional teams, I ensure the efficient integration of backend systems and the effective utilization of data to meet the needs of the editorial and front-end teams."
      },
      {
        "company": "GlobalLogic",
        "title": "Platform & Backend Software Engineer",
        "years": "Aug. 2020 - Dec. 2022.",
        "description": "Building upon my strong foundation in Software Development, I joined the platform team. As a member of this team, my primary focus has been developing templates for internal use, enabling efficient and streamlined processes across the organization. Additionally, I have taken an active role in conducting interviews for potential new team members, assessing their skills and suitability for the team. Furthermore, I have contributed to the onboarding process, providing guidance and support to new hires as they familiarize themselves with the platform. Through these responsibilities, I have been able to contribute to the growth and success of the team while leveraging my expertise in software development."
      },
      {
        "company": "Avalith",
        "title": "Fullstack Developer",
        "years": "Mar. 2019 - Aug. 2020",
        "description": "As a Full Stack Developer, I not only contributed to various projects but also took on additional responsibilities. I actively participated in the recruitment process, conducting interviews and assessing candidates for the company. Additionally, I played a pivotal role in training and mentoring new hires, ensuring their seamless integration into the team and fostering their professional growth. This multifaceted position allowed me to not only excel in technical projects but also contribute to the development and success of the company's talent pool."
      },
      {
        "company": "Boldt S.A",
        "title": "Technician",
        "years": "Apr. 2015 - Jun. 2018",
        "description": "I played a crucial role in the setup and configuration of slot machines, overseeing the entire process from hardware installation to final software configuration. This involved meticulously ensuring the seamless integration of the machines, conducting thorough testing, and troubleshooting any technical issues that arose. By leveraging my expertise in hardware and software, I contributed to the successful deployment of fully operational and optimized slot machines, enhancing the overall gaming experience for customers."
      }
    ],
    "projects": [
      {
        "partner": "AMC Networks",
        "name": "Ingest Script",
        "years": "Dec. 2022 - Present",
        "description": "The main purpose is to fetch streaming schedule data from Nielsen, and extend the data from a CMS",
        "techStack": [
          "Node",
          "AWS Batch",
          "CloudWatch",
          "FTP",
          "Cloudinary",
          "Splunk"
        ]
      },
      {
        "partner": "AMC Networks",
        "name": "Universal Search",
        "years": "Dec. 2022 - Present",
        "description": "Node.Js ETL Service that uses a third party integration and put the parsed content in a s3 bucket",
        "techStack": [
          "Node",
          "Express",
          "Xls",
          "Kafka",
          "AWS",
          "CloudWatch",
          "Stoplight",
          "Splunk"
        ]
      },
      {
        "partner": "GameStop",
        "name": "Launchpad templates generator",
        "years": "Aug. 2020 - Dec. 2022",
        "description": "A CLI tool built with yeoman that generates basic rest API (on the most common scenario). It comes with a fully configured pipeline to be deployed with a CI/CD strategy.",
        "techStack": [
          "Node",
          "React",
          "Monorepo with nx",
          "Go",
          "Java",
          ".NET",
          "C#",
          "TypeScript",
          "Docker",
          "Cloudformation",
          "Terraform",
          "New relic",
          "JFrog",
          "Prisma",
          "AWS",
          "Spring",
          "Express",
          "Jest",
          "Junit",
          "Lombok"
        ]
      },
      {
        "partner": "GameStop",
        "name": "Hyperion PBCS",
        "years": "Sept. 2020 - Jan. 2022",
        "description": "A service to be able to parse from an s3 file into a CSV that has a unique format to be imported on a business program for the GameStop team.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "Git (GitLab)",
          "Jira",
          "AWS-SDK",
          "Streams",
          "Node Custom transforms"
        ]
      },
      {
        "partner": "GameStop",
        "name": "Narvar Shipment Processor",
        "years": "Sept. 2020 - Jan. 2022",
        "description": "An application to handle a write event on an s3 bucket that generates a shipment order with the file content uploaded on the bucket.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "Git (GitLab)",
          "Jira",
          "AWS-SDK",
          "SQS-Consumer"
        ]
      },
      {
        "partner": "Rappi",
        "name": "Rappi Games",
        "years": "Jun. 2020 - Aug. 2020",
        "description": "Backend service to handle tournament tokens to be used on the Rappi games app.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira"
        ]
      },
      {
        "partner": "Rappi",
        "name": "Live",
        "years": "May. 2020 - Jun. 2020",
        "description": "App to buy and see live streams through the platform of Rappi.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira"
        ]
      },
      {
        "partner": "Rappi",
        "name": "Gifts",
        "years": "Fab. 2020 - May. 2020",
        "description": "App inside Rappi platform to send gifts (inside the Rappi store) to your contacts.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira"
        ]
      },
      {
        "partner": "Rappi",
        "name": "Ticket Events",
        "years": "Sept. 2019 - Fab. 2020",
        "description": "A backend service using Latam integrations to sell tickets for concerts through the platform of Rappi.",
        "techStack": [
          "Node",
          "TypeScript",
          "Express",
          "Jest",
          "MongoDB",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira",
          "SOAP"
        ]
      },
      {
        "partner": "Rappi",
        "name": "Aliados",
        "years": "Aug. 2019 - Sept. 2019",
        "description": "A backend service to be able to scrape web and services of the competing companies.",
        "techStack": [
          "Java 11",
          "Lombok",
          "Spring Boot",
          "Open Csv",
          "Jsoup",
          "Git (Bitbucket)",
          "MongoDB",
          "Threads"
        ]
      },
      {
        "partner": "Origenes Seguros",
        "name": "Onboarding Page",
        "years": "Jul. 2019 - Aug. 2019",
        "description": "Onboarding of a landing page.",
        "techStack": [
          "React using Hooks",
          "SASS",
          "Gulp",
          "Git (with GitLab)",
          "Pixel perfect designs."
        ]
      }
    ]
  }
}