{
  "main": {
    "name": "Franco Mischuk",
    "occupation": "Senior Platform Engineer/Backend Developer",
    "description": "With a passion for perfection, my goal is to contribute my skills and expertise to a supportive and stable company. I am driven to continuously develop and improve my abilities, aiming to become an exceptional software developer.",
    "profilePicture": "/images/profilepic.jpg",
    "bio": "As a driven professional, I possess an unwavering determination to excel and continuously grow in my work. I thrive on challenges and consistently strive for excellence in every endeavor. My relentless pursuit of improvement fuels my motivation to deliver exceptional results and surpass expectations. With a strong work ethic and a commitment to excellence, I consistently strive to go above and beyond to achieve optimal outcomes.",
    "email": "mischuk.ti@gmail.com",
    "phone": "+54 9 223 518-1256",
    "address": {
      "city": "Mar Del Plata",
      "state": "Buenos Aires"
    },
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/franco-mischuk-125a46149/",
        "faPrefix": "fab",
        "faIcon": "linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Frachuk",
        "faPrefix": "fab",
        "faIcon": "github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "National Technological University",
        "degree": "Superior Technician in Programming",
        "graduated": "2018",
        "description": "After completing my technician school, I eagerly pursued a bachelor's degree. Concurrently, I embarked on a professional journey as a technician at the local Casino, where I had the opportunity to apply my programming and software skills. During my time at the university, I not only expanded my foundational knowledge but also honed my abilities through practical tasks related to programming and software development at the casino. This valuable experience allowed me to further solidify my expertise and bridge the gap between theory and real-world application."
      },
      {
        "school": "High Technician School N ° 5",
        "degree": "Computer Technician",
        "graduated": "2015",
        "description": "I took my first steps in the programming world, laying the foundation of my technical knowledge. Through engaging coursework and practical projects, I gained proficiency in programming languages, algorithms, and software development principles. This immersive experience ignited my curiosity and honed my problem-solving skills, fueling my passion for pursuing a career in technology."
      }
    ],
    "work": [
      {
        "company": "GlobalLogic",
        "title": "Backend Software Engineer",
        "years": "Dec. 2022 - Present.",
        "description": "At present, I am working as a Backend Software Engineer, actively collaborating with the editorial, manifest, and front-end teams. In this capacity, I play a vital role in enhancing the data displayed on the web platform. By leveraging my skills and expertise, I contribute to enriching the content and delivering a seamless user experience. Through close collaboration with cross-functional teams, I ensure the efficient integration of backend systems and the effective utilization of data to meet the needs of the editorial and front-end teams."
      },
      {
        "company": "GlobalLogic",
        "title": "Platform & Backend Software Engineer",
        "years": "Aug. 2020 - Dec. 2022.",
        "description": "Building upon my strong foundation in Software Development, I joined the platform team. As a member of this team, my primary focus has been developing templates for internal use, enabling efficient and streamlined processes across the organization. Additionally, I have taken an active role in conducting interviews for potential new team members, assessing their skills and suitability for the team. Furthermore, I have contributed to the onboarding process, providing guidance and support to new hires as they familiarize themselves with the platform. Through these responsibilities, I have been able to contribute to the growth and success of the team while leveraging my expertise in software development."
      },
      {
        "company": "Avalith",
        "title": "Fullstack Developer",
        "years": "Mar. 2019 - Aug. 2020",
        "description": "As a Full Stack Developer, I not only contributed to various projects but also took on additional responsibilities. I actively participated in the recruitment process, conducting interviews and assessing candidates for the company. Additionally, I played a pivotal role in training and mentoring new hires, ensuring their seamless integration into the team and fostering their professional growth. This multifaceted position allowed me to not only excel in technical projects but also contribute to the development and success of the company's talent pool."
      },
      {
        "company": "Boldt S.A",
        "title": "Technician",
        "years": "Apr. 2015 - Jun. 2018",
        "description": "I played a crucial role in the setup and configuration of slot machines, overseeing the entire process from hardware installation to final software configuration. This involved meticulously ensuring the seamless integration of the machines, conducting thorough testing, and troubleshooting any technical issues that arose. By leveraging my expertise in hardware and software, I contributed to the successful deployment of fully operational and optimized slot machines, enhancing the overall gaming experience for customers."
      }
    ],
    "projects": [
      {
        "partner": "AMC Networks",
        "rol": "Backend Developer",
        "name": "Ingest Script",
        "years": "Dec. 2022 - Present",
        "description": "As a Backend Developer at AMC Networks, I am currently working on the Ingest Script project. This project aims to develop a script that fetches streaming schedule data from Nielsen, a trusted source, and extends the data using a Content Management System (CMS). The script is built using Node.js and utilizes AWS Batch for scalable and efficient execution. CloudWatch is used for monitoring and logging, while FTP is employed to fetch the data from Nielsen. The extended data is stored and managed using Cloudinary, and Splunk is utilized for centralized logging and analysis. With the Ingest Script project, AMC Networks aims to automate the process of fetching and extending streaming schedule data, ensuring accurate and up-to-date information for their content management system.",
        "techStack": [
          "Node",
          "AWS Batch",
          "CloudWatch",
          "FTP",
          "Cloudinary",
          "Splunk"
        ]
      },
      {
        "partner": "AMC Networks",
        "rol": "Backend Developer",
        "name": "Universal Search",
        "years": "Dec. 2022 - Present",
        "description": "As a Backend Developer at AMC Networks, I am currently working on the Universal Search project. This project involves the development of a Node.js ETL service that utilizes a third-party integration to parse content, which is then stored in an S3 bucket. The project leverages a tech stack that includes Node.js, Express, Xls for content parsing, Kafka for event-driven data processing, and various AWS services such as CloudWatch for monitoring. Additionally, Stoplight is used for API documentation, and Splunk is employed for centralized logging and analysis. With the Universal Search project, AMC Networks aims to enhance search capabilities by efficiently extracting, transforming, and storing data, ensuring optimal performance and reliability throughout the system.",
        "techStack": [
          "Node",
          "Express",
          "Xls",
          "Kafka",
          "AWS",
          "CloudWatch",
          "Stoplight",
          "Splunk"
        ]
      },
      {
        "partner": "Myself",
        "rol": "Frontend Developer",
        "name": "This resume",
        "years": "N/A - Present",
        "description": "I created my own resume page using React, implementing the Bootstrap grid system and custom CSS for a visually appealing and responsive layout. Leveraging React's capabilities, I built a dynamic and interactive resume page that effectively showcases my skills and experiences. By utilizing the Bootstrap grid system, I ensured a responsive design that adapts seamlessly to various screen sizes and devices. Through the use of custom CSS, I added a unique and professional touch to the page's appearance. Employing Jest for testing, I ensured the reliability and functionality of the components, while gh-pages facilitated easy deployment on GitHub Pages. This project not only showcased my frontend development skills, but also demonstrated my ability to independently create an engaging user interface using modern technologies.",
        "techStack": [
          "React",
          "jest",
          "gh-pages",
          "bootstrap"
        ]
      },
      {
        "partner": "Savvi",
        "rol": "Frontend Developer",
        "name": "Savvi - UI",
        "webPage": "https://www.savvi.com/www",
        "years": "Sept. 2022 - Mar. 2023",
        "description": "I held the role of Frontend Developer. During this time, I focused on improving and refactoring the existing e-commerce page to reduce code complexity and enhance performance.",
        "techStack": [
          "Angular",
          "FontAwesome",
          "Bootstrap"
        ]
      },
      {
        "partner": "GameStop",
        "rol": "Platform Engineer",
        "name": "Launchpad templates generator",
        "years": "Aug. 2020 - Dec. 2022",
        "description": "The GameStop CLI tool, built with Yeoman, provides developers with a streamlined solution for generating a basic REST API tailored to common scenarios. With automated scaffolding, this tool significantly reduces development time and effort. Additionally, it comes with a fully configured pipeline, enabling seamless integration into a CI/CD strategy. The pipeline includes automated testing, code quality checks, and efficient deployment, ensuring a reliable and streamlined release process. By leveraging this CLI tool, GameStop developers can accelerate REST API development while adhering to industry best practices for CI/CD.",
        "techStack": [
          "Node",
          "React",
          "Monorepo with nx",
          "Go",
          "Java",
          ".NET",
          "C#",
          "TypeScript",
          "Docker",
          "Cloudformation",
          "Terraform",
          "New relic",
          "JFrog",
          "Prisma",
          "AWS",
          "Spring",
          "Express",
          "Jest",
          "Junit",
          "Lombok"
        ]
      },
      {
        "partner": "GameStop",
        "rol": "Backend Developer",
        "name": "Hyperion PBCS",
        "years": "Sept. 2020 - Jan. 2022",
        "description": "I worked on the Narvar Shipment Processor project. This service was developed to parse data from an S3 file and convert it into a CSV format with a unique structure. The generated CSV file was specifically designed to be imported into a business program used by the GameStop team, facilitating the seamless integration of shipment data for further processing and analysis.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "Git (GitLab)",
          "Jira",
          "AWS-SDK",
          "Streams",
          "Node Custom transforms"
        ]
      },
      {
        "partner": "GameStop",
        "rol": "Backend Developer",
        "name": "Narvar Shipment Processor",
        "years": "Sept. 2020 - Jan. 2022",
        "description": "This application was designed to handle a write event on an S3 bucket. The primary functionality of the application was to generate a shipment order based on the content of the file uploaded to the bucket.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "Git (GitLab)",
          "Jira",
          "AWS-SDK",
          "SQS-Consumer"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Rappi Games",
        "years": "Jun. 2020 - Aug. 2020",
        "description": "This involved developing a backend service to handle tournament tokens for the Rappi Games app. The service was responsible for managing and processing the tokens used in tournaments within the app, ensuring a seamless gaming experience for users.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Live",
        "years": "May. 2020 - Jun. 2020",
        "description": "I worked on the Live project, which involved the development of an application on the Rappi platform that allowed users to purchase and watch live streams. This feature provided users with the convenience of accessing and enjoying live content directly through the Rappi platform.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Gifts",
        "years": "Fab. 2020 - May. 2020",
        "description": "I worked on the Gifts project, developing an application within the Rappi platform that allowed users to send gifts to their contacts. This feature was integrated into the Rappi store, enabling users to conveniently select and send gifts to their desired recipients.",
        "techStack": [
          "Node",
          "Express",
          "Jest",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Ticket Events",
        "years": "Sept. 2019 - Fab. 2020",
        "description": "I worked on the Ticket Events project, which involved the development of a backend service to facilitate the sale of concert tickets through the Rappi platform. The service integrated with various Latam ticketing systems, enabling seamless ticket purchases for Rappi users.",
        "techStack": [
          "Node",
          "TypeScript",
          "Express",
          "Jest",
          "MongoDB",
          "PostgreSQL",
          "Git (Bitbucket)",
          "Jira",
          "SOAP"
        ]
      },
      {
        "partner": "Rappi",
        "rol": "Backend Developer",
        "name": "Aliados",
        "years": "Aug. 2019 - Sept. 2019",
        "description": "I was in charge of development a backend service to scrape data from various competing companies' websites and services. The objective was to gather relevant information from these sources and integrate it into Rappi's platform for analysis and comparison.",
        "techStack": [
          "Java 11",
          "Lombok",
          "Spring Boot",
          "Open Csv",
          "Jsoup",
          "Git (Bitbucket)",
          "MongoDB",
          "Threads"
        ]
      },
      {
        "partner": "Origenes Seguros",
        "rol": "Frontend Developer",
        "name": "Onboarding Page",
        "years": "Jul. 2019 - Aug. 2019",
        "description": "I was responsible for the onboarding of a landing page. The objective of this project was to create an engaging and user-friendly onboarding experience for new users.",
        "techStack": [
          "React using Hooks",
          "SASS",
          "Gulp",
          "Git (with GitLab)",
          "Pixel perfect designs."
        ]
      }
    ]
  }
}